In [63]:
import numpy as np
import pandas as pd

In [64]:
s1=pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))

In [65]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [82]:
dates=pd.date_range('20130101',periods=6)

In [83]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [84]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [85]:
df

                   A         B         C         D
2013-01-01 -0.683036  2.070948  0.062889  0.004841
2013-01-02 -0.654954 -1.137875 -0.217166 -0.144278
2013-01-03  1.802349  1.405457 -0.805974  0.220153
2013-01-04  0.108710  1.827143 -0.079189  1.347153
2013-01-05 -1.257773 -0.328962  1.187699 -0.628033
2013-01-06 -0.236123 -0.230464 -0.682878  0.437643

In [70]:
df['F']=s1

In [71]:
df.at[dates[0],'A']=0

In [72]:
df.iat[0,1]=0

In [73]:
df.loc[:,'D']=np.array([5]*len(df))

In [74]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.625317  5  NaN
2013-01-02 -0.270500  0.292933  0.529841  5  1.0
2013-01-03 -1.546271 -0.214486 -0.683445  5  2.0
2013-01-04 -0.180446  0.749070  0.207078  5  3.0
2013-01-05 -1.646350  1.004904 -1.069248  5  4.0
2013-01-06 -0.466480 -0.141089 -0.516927  5  5.0

In [75]:
df2=df.copy()

In [76]:
df2[df2>0]=-df2

In [77]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.625317 -5  NaN
2013-01-02 -0.270500 -0.292933 -0.529841 -5 -1.0
2013-01-03 -1.546271 -0.214486 -0.683445 -5 -2.0
2013-01-04 -0.180446 -0.749070 -0.207078 -5 -3.0
2013-01-05 -1.646350 -1.004904 -1.069248 -5 -4.0
2013-01-06 -0.466480 -0.141089 -0.516927 -5 -5.0

In [86]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [87]:
df1.loc[dates[0]:dates[1],'E']=1

In [88]:
df1

                   A         B         C         D    E
2013-01-01 -0.683036  2.070948  0.062889  0.004841  1.0
2013-01-02 -0.654954 -1.137875 -0.217166 -0.144278  1.0
2013-01-03  1.802349  1.405457 -0.805974  0.220153  NaN
2013-01-04  0.108710  1.827143 -0.079189  1.347153  NaN

In [89]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01 -0.683036  2.070948  0.062889  0.004841  1.0
2013-01-02 -0.654954 -1.137875 -0.217166 -0.144278  1.0

In [93]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -0.683036  2.070948  0.062889  0.004841  1.0
2013-01-02 -0.654954 -1.137875 -0.217166 -0.144278  1.0
2013-01-03  1.802349  1.405457 -0.805974  0.220153  5.0
2013-01-04  0.108710  1.827143 -0.079189  1.347153  5.0

In [94]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [95]:
df.mean()

A   -0.153471
B    0.601041
C   -0.089103
D    0.206246
dtype: float64

In [96]:
df.mean(1)

2013-01-01    0.363910
2013-01-02   -0.538568
2013-01-03    0.655496
2013-01-04    0.800954
2013-01-05   -0.256767
2013-01-06   -0.177956
Freq: D, dtype: float64

In [97]:
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)

In [98]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [99]:
df.sub(s,axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.802349  0.405457 -1.805974 -0.779847
2013-01-04 -2.891290 -1.172857 -3.079189 -1.652847
2013-01-05 -6.257773 -5.328962 -3.812301 -5.628033
2013-01-06       NaN       NaN       NaN       NaN

In [100]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.683036  2.070948  0.062889  0.004841
2013-01-02 -1.337990  0.933073 -0.154278 -0.139437
2013-01-03  0.464359  2.338529 -0.960252  0.080716
2013-01-04  0.573069  4.165673 -1.039441  1.427869
2013-01-05 -0.684704  3.836711  0.148258  0.799835
2013-01-06 -0.920827  3.606246 -0.534620  1.237479

In [101]:
df.apply(lambda x: x.max()-x.min())

A    3.060122
B    3.208823
C    1.993673
D    1.975186
dtype: float64

In [102]:
s=pd.Series(np.random.randint(0,7,size=10))

In [103]:
s

0    4
1    6
2    4
3    0
4    4
5    6
6    6
7    1
8    1
9    5
dtype: int64

In [104]:
s.value_counts()

6    3
4    3
1    2
5    1
0    1
dtype: int64

In [105]:
s=pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'])

In [106]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [107]:
df=pd.DataFrame(np.random.randn(10,4))

In [108]:
df

          0         1         2         3
0 -0.800902 -1.507475  0.212815 -2.138730
1 -0.083981  0.335454 -1.405400  2.393846
2  1.121765  0.389097  0.049902 -0.734484
3  0.286764  0.494937 -2.129088 -0.930584
4  0.419721 -2.118852 -1.961358 -0.120552
5 -1.698090  0.231978  0.655366 -0.866196
6  1.235018 -1.691562  0.044310  1.024041
7 -0.465884 -1.084949 -0.146653  0.627792
8  0.474176 -2.015877 -1.061944 -0.112576
9  0.529460  0.664825 -0.109749  0.313433

In [109]:
#break it into pieces
pieces=[df[:3],df[3:7],df[7:]]

In [111]:
pieces

[          0         1         2         3
 0 -0.800902 -1.507475  0.212815 -2.138730
 1 -0.083981  0.335454 -1.405400  2.393846
 2  1.121765  0.389097  0.049902 -0.734484,
           0         1         2         3
 3  0.286764  0.494937 -2.129088 -0.930584
 4  0.419721 -2.118852 -1.961358 -0.120552
 5 -1.698090  0.231978  0.655366 -0.866196
 6  1.235018 -1.691562  0.044310  1.024041,
           0         1         2         3
 7 -0.465884 -1.084949 -0.146653  0.627792
 8  0.474176 -2.015877 -1.061944 -0.112576
 9  0.529460  0.664825 -0.109749  0.313433]

In [112]:
pd.concat(pieces)

          0         1         2         3
0 -0.800902 -1.507475  0.212815 -2.138730
1 -0.083981  0.335454 -1.405400  2.393846
2  1.121765  0.389097  0.049902 -0.734484
3  0.286764  0.494937 -2.129088 -0.930584
4  0.419721 -2.118852 -1.961358 -0.120552
5 -1.698090  0.231978  0.655366 -0.866196
6  1.235018 -1.691562  0.044310  1.024041
7 -0.465884 -1.084949 -0.146653  0.627792
8  0.474176 -2.015877 -1.061944 -0.112576
9  0.529460  0.664825 -0.109749  0.313433

In [113]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})

In [114]:
right=pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})

In [115]:
left

   key  lval
0  foo     1
1  foo     2

In [116]:
right

   key  rval
0  foo     4
1  foo     5

In [117]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [118]:
left=pd.DataFrame({'key':['foo','bar'],'lval':[1,2]})

In [119]:
right=pd.DataFrame({'key':['foo','bar'],'rval':[4,5]})

In [120]:
left

   key  lval
0  foo     1
1  bar     2

In [121]:
right

   key  rval
0  foo     4
1  bar     5

In [122]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [123]:
df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])

In [124]:
df

          A         B         C         D
0  0.294959 -0.672489 -2.220435 -2.240292
1 -1.361793 -0.959584 -0.109008  1.322971
2 -0.789132  0.120520  1.385644  1.613267
3 -0.423377 -2.313794 -1.268735 -1.109608
4 -2.636592 -1.121843  1.084813  1.369473
5 -1.643034 -0.230897  0.877766 -0.479898
6 -0.688761  0.346243  1.303570 -0.850701
7  0.415871 -0.787314 -0.229737 -1.254294

In [125]:
s=df.iloc[3]

In [126]:
df.append(s,ignore_index=True)

          A         B         C         D
0  0.294959 -0.672489 -2.220435 -2.240292
1 -1.361793 -0.959584 -0.109008  1.322971
2 -0.789132  0.120520  1.385644  1.613267
3 -0.423377 -2.313794 -1.268735 -1.109608
4 -2.636592 -1.121843  1.084813  1.369473
5 -1.643034 -0.230897  0.877766 -0.479898
6 -0.688761  0.346243  1.303570 -0.850701
7  0.415871 -0.787314 -0.229737 -1.254294
8 -0.423377 -2.313794 -1.268735 -1.109608

In [127]:
df=pd.DataFrame(
{
    'A':['foo','bar','foo','bar','foo','bar','foo','foo'],
    'B':['one','one','two','three','two','two','one','three'],
    'C':np.random.randn(8),
    'D':np.random.randn(8)
    
})

In [128]:
df

     A      B         C         D
0  foo    one -0.154702  0.100579
1  bar    one -0.004612  1.268840
2  foo    two  1.014949 -1.650913
3  bar  three -2.470654 -1.627472
4  foo    two  0.191644  0.789253
5  bar    two -0.164957 -0.115317
6  foo    one  0.492161  1.627870
7  foo  three  1.154281  0.125209

In [129]:
df.groupby('A').sum()

            C         D
A
bar -2.640222 -0.473948
foo  2.698333  0.991998

In [130]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.004612  1.268840
    three -2.470654 -1.627472
    two   -0.164957 -0.115317
foo one    0.337459  1.728449
    three  1.154281  0.125209
    two    1.206593 -0.861660

In [131]:
tuples=list(zip(*[['bar','bar','baz','baz',
                  'foo','foo','qux','qux'],
                 ['one','two','one','two',
                 'one','two','one','two']]))

In [132]:
index=pd.MultiIndex.from_tuples(tuples,names=['first','second'])

In [133]:
df=pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])

In [138]:
df2=df[:4]

In [139]:
df2

                     A         B
first second
bar   one     0.538202 -0.082781
      two    -0.022866 -0.050165
baz   one     1.121375 -1.667776
      two    -0.730656 -0.791903

In [140]:
stacked=df2.stack()

In [141]:
stacked

first  second
bar    one     A    0.538202
               B   -0.082781
       two     A   -0.022866
               B   -0.050165
baz    one     A    1.121375
               B   -1.667776
       two     A   -0.730656
               B   -0.791903
dtype: float64

In [142]:
stacked.unstack()

                     A         B
first second
bar   one     0.538202 -0.082781
      two    -0.022866 -0.050165
baz   one     1.121375 -1.667776
      two    -0.730656 -0.791903

In [143]:
stacked.unstack(1)

second        one       two
first
bar   A  0.538202 -0.022866
      B -0.082781 -0.050165
baz   A  1.121375 -0.730656
      B -1.667776 -0.791903

In [144]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.538202  1.121375
       B -0.082781 -1.667776
two    A -0.022866 -0.730656
       B -0.050165 -0.791903

In [145]:
df=pd.DataFrame({'A':['one','one','two','three']*3,
                 'B':['A','B','C']*4,
                 'C':['foo','foo','foo','bar','bar','bar']*2,
                 'D':np.random.randn(12),
                 'E':np.random.randn(12)})

In [146]:
df

        A  B    C         D         E
0     one  A  foo -0.502020  1.665714
1     one  B  foo -0.559074  1.656561
2     two  C  foo  1.033544  0.177162
3   three  A  bar -1.305479  1.255030
4     one  B  bar -0.146981 -0.771826
5     one  C  bar  0.283792 -0.428303
6     two  A  foo  0.319693 -2.310350
7   three  B  foo  1.120555 -1.038065
8     one  C  foo -1.978023  1.151450
9     one  A  bar  0.219726 -0.277970
10    two  B  bar -0.505556 -1.911275
11  three  C  bar  1.039500  0.163348

In [147]:
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

C             bar       foo
A     B
one   A  0.219726 -0.502020
      B -0.146981 -0.559074
      C  0.283792 -1.978023
three A -1.305479       NaN
      B       NaN  1.120555
      C  1.039500       NaN
two   A       NaN  0.319693
      B -0.505556       NaN
      C       NaN  1.033544